{
  "info": {
    "title": "Portfolio React",
    "text": "En este proyecto, experimenté mejoras en la legibilidad y modularidad del código en comparación con el portfolio anterior, que fue realizado en Vanilla JS. \n\n Puse en práctica el uso de hooks como useState y useEffect, hooks personalizados, contexto, componentes, estilos complejos con CSS, renderizado condicional con JSX, manejo de rutas con React Router, entre otras cosas.\n\n Más recientemente agregué fetch para centralizar el contenido de los Portfolios desarrollados en diferentes tecnologías. Ahora lo provee un CDN",
    "continue": "Continuar"
  },
  "description": "Soy un desarrollador web en crecimiento con enfoque en Frontend, trabajando con JavaScript y React mientras exploro nuevas tecnologías. Mis bases en lógica de programación me permiten enfrentar desafíos técnicos con confianza, siempre buscando mejorar y adaptarme a las tendencias del mercado.",
  "menu": {
    "home": "Inicio",
    "skills": "Habilidades",
    "projects": "Proyectos",
    "exercises": "Odisea",
    "certifications": "Certificaciones"
  },
  "projects": {
    "info": {
      "title": "Sección Proyectos",
      "text": "En esta sección muestro trabajos de mi autoría, ya sea un desafío que me pidieron en un curso o alguna idea que tuve por mi cuenta.",
      "continue": "Continuar"
    },
    "projectsList": {
      "rqm": {
        "title": "Máquina de Citas Aleatorias (React)",
        "description": "Esta debe haber sido mi primer experiencia con peticiones asíncronas hacia una API externa. Utilizando la librería 'Axios' en este caso y el manejo de estado en React",
        "close": "Cerrar",
        "open": "Abrir proyecto"
      },
      "mdp": {
        "title": "Previsualizdor de Markdown (React)",
        "description": "Formateador de texto a Markdown en el cual puse en práctica el manejo de estado de React y utilicé la librería 'marked'",
        "close": "Cerrar",
        "open": "Abrir proyecto"
      },
      "drum": {
        "title": "Caja de Ritmos (React)",
        "description": "Caja de sonidos en la cual puse en práctica el manejo de estado y de efecto en React, y de grid en Css",
        "close": "Cerrar",
        "open": "Abrir proyecto"
      },
      "calculator": {
        "title": "Calculadora JS (React)",
        "description": "Calculadora en la cual puse en práctica el manejo de estado y de efecto en React, y de grid en Css. También recuerdo que me hizo pensar mucho para resolver la lógica de cada posible situación para hacerla 'irrompible'.",
        "close": "Cerrar",
        "open": "Abrir proyecto"
      },
      "pomodoro": {
        "title": "Reloj Pomodoro (React)",
        "description": "En el reloj pomodoro puse en práctica un manejo mas avanzado del estado como también del efecto con la utilización de callbacks y el monitoreo de dependencias. No fue fácil pasar todos los test ya que tiene una lógica avanzada para el nivel que traía hasta ese momento. También se usó useRef.",
        "close": "Cerrar",
        "open": "Abrir proyecto"
      },
      "portfolioJS": {
        "title": "Portafolio (Vainilla JS)",
        "description": "En el viejo portafolio pude poner en práctica la programación orientada a eventos con Vanilla JavaScript y el diseño responsivo. También más recientemente incorporé el fetch para tener la modificación de contenido de todos los portfolios centralizada en un JSON",
        "close": "Cerrar",
        "open": "Abrir proyecto"
      },
      "portfolioReact": {
        "title": "Portafolio (React)",
        "description": "En este proyecto, experimenté mejoras en la legibilidad y modularidad del código en comparación con el portfolio anterior, que fue realizado en Vanilla JS. \n\n Puse en práctica el uso de hooks como useState y useEffect, hooks personalizados, contexto, componentes, estilos complejos con CSS, renderizado condicional con JSX, manejo de rutas con React Router, entre otras cosas.",
        "close": "Cerrar",
        "open": "Abrir proyecto"
      }
    }
  },
  "exercises": {
    "info": {
      "title": "Sección Odisea",
      "text": "En esta sección comparto proyectos realizados durante mis estudios, donde seguí los pasos de las clases y fui profundizando en los conceptos a medida que me iban surgiendo dudas.",
      "continue": "Continuar"
    },
    "exercisesList": {
      "dom": {
        "title": "DOM (JS Vainilla)",
        "description": "Ejercicio práctico sobre la manipulación del DOM con JavaScript, explorando eventos y modificando el contenido dinámicamente.",
        "close": "Cerrar",
        "open": "Ver Ejercicio"
      },
      "draw": {
        "title": "Dibujo (JS Vainilla; para PC)",
        "description": "Introducción a la creación de gráficos en la web usando el elemento Canvas de HTML5 y JavaScript para dibujar.",
        "close": "Cerrar",
        "open": "Ver Ejercicio"
      },
      "tetris": {
        "title": "Tetris (JS Vainilla)",
        "description": "Implementación del clásico juego de Tetris usando solo JavaScript, HTML y CSS, poniendo en práctica el manejo del tiempo y la manipulación del DOM.",
        "close": "Cerrar",
        "open": "Ver Ejercicio"
      },
      "monkeytype": {
        "title": "Mecanografía (JS Vainilla; para PC)",
        "description": "Ejercicio para mejorar la velocidad de escritura en teclado a través de la creación de una aplicación interactiva que mide y evalúa la velocidad de tipeo.",
        "close": "Cerrar",
        "open": "Ver Ejercicio"
      },
      "excel": {
        "title": "Excel (JS Vainilla; para PC)",
        "description": "En este ejercicio puse en práctica mi lógica de programación. Imita algunas funciones básicas de Excel. Pretendo seguir ampliando sus funcionalidades ya que me resulta un desafío interesante. ",
        "close": "Cerrar",
        "open": "Ver Ejercicio"
      },
      "nextjsBlog": {
        "title": "Blog (Next.js)",
        "description": "Proyecto para principiantes. Comenzando a familiarizarse con Next.js y su estructura. En esta ocasión se trata de un blog que usa las bibliotecas 'gray-matter' y 'markdown-it' para dar formato a los artículos.",
        "close": "Cerrar",
        "open": "Ver Ejercicio"
      }
    }
  },
  "certifications": {
    "buttons": {
      "view-more": "Ver certificaciones secundarias...",
      "view-less": "Ocultar certificaciones secundarias..."
    },
    "info": {
      "title": "Sección Certificaciones",
      "text": "Si ingresas en 'Ver certificación', en cada una de ellas (freeCodeCamp) podrás ver los proyectos realizados en ese curso.",
      "continue": "Continuar"
    },
    "certificationsList": {
      "rwd": {
        "title": "Diseño Web Responsivo",
        "description": "Certificación que abarca los conceptos esenciales del diseño web, incluyendo CSS Flexbox, CSS Grid, y diseño adaptable a diferentes tamaños de pantalla.",
        "close": "Cerrar",
        "open": "Ver Certificación"
      },
      "javaScript": {
        "title": "Algoritmos JS & Estructuras de datos",
        "description": "Certificación en la que se cubren temas como algoritmos de ordenamiento, estructuras de datos comunes en JavaScript, y la resolución de problemas complejos.",
        "close": "Cerrar",
        "open": "Ver Certificación"
      },
      "fdl": {
        "title": "Librerías de Desarrollo de Interfaz",
        "description": "Certificación enfocada en el uso de librerías populares como React, Redux, y herramientas para el desarrollo de interfaces de usuario.",
        "close": "Cerrar",
        "open": "Ver Certificación"
      },
      "ics": {
        "title": "Introducción a la Ciberseguridad",
        "description": "Realicé este curso para constatar conocimientos básicos en ciberseguridad.",
        "close": "Cerrar",
        "open": "Ver Certificación"
      },
      "html": {
        "title": "HTML",
        "description": "Fundamentos de HTML, estructura básica de páginas web y creación de contenido accesible.",
        "close": "Cerrar",
        "open": "Ver Certificación"
      },
      "html5css3": {
        "title": "HTM5 y CSS3",
        "description": "Introducción a las técnicas modernas de diseño web con HTML5 y CSS3, incluyendo elementos multimedia y estilos avanzados.",
        "close": "Cerrar",
        "open": "Ver Certificación"
      },
      "bbddsql": {
        "title": "Introducción a Bases de datos y SQL",
        "description": "Principios básicos de bases de datos relacionales y consulta de datos mediante SQL.",
        "close": "Cerrar",
        "open": "Ver Certificación"
      },
      "flash": {
        "title": "Flash",
        "description": "Creación de contenido multimedia interactivo con Flash, ideal para animaciones y presentaciones dinámicas.",
        "close": "Cerrar",
        "open": "Ver Certificación"
      },
      "presu": {
        "title": "Presupuesto Web",
        "description": "Estudio de técnicas para calcular costos y elaborar presupuestos efectivos para proyectos web.",
        "close": "Cerrar",
        "open": "Ver Certificación"
      },
      "photoshop": {
        "title": "Photoshop",
        "description": "Edición de imágenes y diseño gráfico utilizando herramientas esenciales de Adobe Photoshop.",
        "close": "Cerrar",
        "open": "Ver Certificación"
      },
      "cssdivs": {
        "title": "CSS y DIVs",
        "description": "Uso de CSS para diseño de páginas web y organización estructural con DIVs, optimizando layouts.",
        "close": "Cerrar",
        "open": "Ver Certificación"
      },
      "jquery": {
        "title": "jQuery",
        "description": "Uso de jQuery para simplificar la manipulación del DOM, efectos visuales y manejo de eventos en JavaScript.",
        "close": "Cerrar",
        "open": "Ver Certificación"
      }
    }
  }
}
